In [44]:
import pandas as pd

In [45]:
df = pd.read_csv('data/enrollment3.csv')
df

           id  year           course name   status room assignment
0     2777729     1               science  allowed      Auditorium
1     2777730     2               science  allowed      Auditorium
2     2777765     1                  arts  allowed      Auditorium
3     2777766     2                  arts  allowed      Auditorium
4     2777785     1                   mba  allowed      Small room
...       ...   ...                   ...      ...             ...
1995  2796805     3  computer application  allowed     Medium room
1996  2796812     1               nursing  allowed     Medium room
1997  2796813     2               nursing  allowed     Medium room
1998  2796814     3               nursing  allowed     Medium room
1999  2796815     4               nursing  allowed     Medium room

[2000 rows x 5 columns]

In [46]:
valid = df['status']=='allowed'
valid

0       True
1       True
2       True
3       True
4       True
        ...
1995    True
1996    True
1997    True
1998    True
1999    True
Name: status, Length: 2000, dtype: bool

In [47]:
df.rename(columns={'room assignment':'room number'},inplace=True)
df

           id  year           course name   status  room number
0     2777729     1               science  allowed   Auditorium
1     2777730     2               science  allowed   Auditorium
2     2777765     1                  arts  allowed   Auditorium
3     2777766     2                  arts  allowed   Auditorium
4     2777785     1                   mba  allowed   Small room
...       ...   ...                   ...      ...          ...
1995  2796805     3  computer application  allowed  Medium room
1996  2796812     1               nursing  allowed  Medium room
1997  2796813     2               nursing  allowed  Medium room
1998  2796814     3               nursing  allowed  Medium room
1999  2796815     4               nursing  allowed  Medium room

[2000 rows x 5 columns]

In [48]:
df['room number'].value_counts()

not assigned    552
Medium room     531
Small room      437
Auditorium      383
Large room       97
Name: room number, dtype: int64

In [49]:
aud = df.loc[(df['room number'] == 'Auditorium'),'course name']
aud.sort_values(inplace=True)
count = 0
init = ""
for i,v in aud.items():
    if init != v:
        count +=1
        init = v
    # print(i,v)
    df.loc[i,'room number']='Auditorium-'+str(count)

med = df.loc[(df['room number'] == 'Medium room'),'course name']
med.sort_values(inplace=True)
count = 0
init = ""
for i,v in med.items():
    if init != v:
        count +=1
        init = v
    # print(i,v)
    df.loc[i,'room number']='Medium-'+str(count)

small = df.loc[(df['room number'] == 'Small room'),'course name']
small.sort_values(inplace=True)
count = 0
init = ""
for i,v in small.items():
    if init != v:
        count +=1
        init = v
    # print(i,v)
    df.loc[i,'room number']='Small-'+str(count)

large = df.loc[(df['room number'] == 'Large room'),'course name']
large.sort_values(inplace=True)
count = 0
init = ""
for i,v in large.items():
    if init != v:
        count +=1
        init = v
    # print(i,v)
    df.loc[i,'room number']='Large-'+str(count)

In [50]:
df

           id  year           course name   status   room number
0     2777729     1               science  allowed  Auditorium-3
1     2777730     2               science  allowed  Auditorium-3
2     2777765     1                  arts  allowed  Auditorium-1
3     2777766     2                  arts  allowed  Auditorium-1
4     2777785     1                   mba  allowed      Small-34
...       ...   ...                   ...      ...           ...
1995  2796805     3  computer application  allowed      Midium-7
1996  2796812     1               nursing  allowed     Midium-22
1997  2796813     2               nursing  allowed     Midium-22
1998  2796814     3               nursing  allowed     Midium-22
1999  2796815     4               nursing  allowed     Midium-22

[2000 rows x 5 columns]

In [52]:
print(df)

id  year           course name   status   room number
0     2777729     1               science  allowed  Auditorium-3
1     2777730     2               science  allowed  Auditorium-3
2     2777765     1                  arts  allowed  Auditorium-1
3     2777766     2                  arts  allowed  Auditorium-1
4     2777785     1                   mba  allowed      Small-34
...       ...   ...                   ...      ...           ...
1995  2796805     3  computer application  allowed      Midium-7
1996  2796812     1               nursing  allowed     Midium-22
1997  2796813     2               nursing  allowed     Midium-22
1998  2796814     3               nursing  allowed     Midium-22
1999  2796815     4               nursing  allowed     Midium-22

[2000 rows x 5 columns]